# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, 
# насколько легко он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов 
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, 
# если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, 
# если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
# *Пример:*
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#     **Вывод:** Парам пам-пам  

vowel_list = ['а', 'е', 'и', 'о']   #словарь гласных 
# puh_poem = input("Введите стих")
puh_poem = "параа-ра-рам раам-пам-папам па-ра-паа-да" 
count_vowel_list = set(map(lambda phrase: len([1 for letter in phrase if letter in vowel_list]), puh_poem.split()))
if(len(count_vowel_list) < 2):
    print("Парам пам-пам")
else:
    print("Пам парам")