# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

import random

n = int(input("Введите кол-во монеток: "))
side_1 = 0
side_2 = 0
for _ in range(0, n):
    side = random.randint(0, 1)
    print(side, end=' ')
    if side:
        side_1 += 1
    else:
        side_2 += 1
print(f'\nМинимальное кол-во переворотов монеток равна {side_1 if side_1 <= side_2 else side_2}')
