# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

import random

S = int(input("Введите сумму чисел: "))
P = int(input("Введите произведение чисел: "))


# 60 = 50 + 10
# 500 = 50 * 10
# 1 способ перебором
a = S
b = 0
print("Вариант 1")
while (a * b != P) and (b < S):
    a -= 1
    b += 1
if b == S:
    print("Нет таких чисел")
else:
    print(a, b)
#2 способ квадратичным уравнением
print("Вариант 2")
D = S*S - 4*P
if D >= 0:
    a = (S + D**0.5 ) / 2
    b = (S - D**0.5 ) / 2
    print(a, b)
else:
    print("Нет таких чисел")