# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

import random

set_1 = list()
set_2 = list()
result_list = list()
n = int(input("Введите кол-во эл. первого множества: "))
m = int(input("Введите кол-во эл. второго множества: "))
for _ in range(n):
     set_1.append(input("Введите эл. первого множества: "))
for _ in range(m):
     set_2.append(input("Введите эл. второго множества: "))
print(set_1)
print(set_2)
for item in set(set_1):
    if item in set_2:
        result_list.append(item)
print(sorted(result_list))